#include "application.hpp"
#include "maze.hpp"
#include <iostream>

using namespace std;

/************************************************************************************/
/* Метод: Application::Application(int argc, char** argv)                           */
/* Цель: конструктор                                                                */
/* Исходные данные:                                                                 */
/* _argc – количество аргументов командной строки                                   */
/* _argv – массив c-строк, аргументы командной строки                               */
/* Возвращаемое значение: нет                                                       */
/* Вызываемые модули: нет                                                           */
/* Дата: 2025 / 04 / 26 Версия 1.01                                                 */
/* Автор: Гущина М.О.                                                               */
/************************************************************************************/
Application::Application(int _argc, char **_argv)
{
    argc = _argc;
    argv = _argv;
}

/************************************************************************************/
/* Метод: void Application::generateMaze()                                          */
/* Цель: обработчик запуска приложения в режиме генерации                           */
/* лабиринта (опции -g / --generate)                                                */
/* Исходные данные: нет                                                             */
/* Возвращаемое значение: нет                                                       */
/* Вызываемые модули: Maze::generateMaze(), Maze::printMaze(), Maze::writeToFile()  */
/* Дата: 2025 / 04 / 26 Версия 1.01                                                 */
/* Автор: Гущина М.О.                                                               */
/************************************************************************************/
void Application::generateMaze()
{
    Maze maze;
    cout << "\x1B[2J\x1B[0;0f"; // очистка экрана и перевод курсора в левый верхний угол
    maze.generateMaze();
    maze.printMaze();
    if (argv[2]) {
        maze.writeToFile(argv[2]);
    }
}

/************************************************************************************/
/* Метод: void Application::readMaze()                                              */
/* Цель: обработчик запуска приложения в режиме чтения лабиринта из файла           */
/* (опции -r / --read)                                                              */
/* Исходные данные: нет                                                             */
/* Возвращаемое значение: нет                                                       */
/* Вызываемые модули: Maze::readFromFile(), Maze::printMaze()                       */
/* Дата: 2025 / 04 / 26 Версия 1.01                                                 */
/* Автор: Гущина М.О.                                                               */
/************************************************************************************/
void Application::readMaze()
{
    Maze maze;
    cout << "\x1B[2J\x1B[0;0f"; // очистка экрана и перевод курсора в левый верхний угол
    maze.readFromFile(argv[2]);
    maze.printMaze();
}

/************************************************************************************/
/* Метод: void Application::Run()                                                   */
/* Цель: разбор аргументов командной строки, определение режима запуска приложения, */
/* и выполнение соответствующего обработчика                                        */
/* Исходные данные: нет                                                             */
/* Возвращаемое значение: нет                                                       */
/* Вызываемые модули: Application::generateMaze(), Application::readMaze(),         */
/* Application::printHelp()                                                         */
/* Выбрасываемое исключение: invalid_argument                                       */
/* Дата: 2025 / 04 / 26 Версия 1.01                                                 */
/* Автор: Гущина М.О.                                                               */
/************************************************************************************/
void Application::Run()
{
    if (argc >= 2 && argc <= 3) {
        string arg = argv[1];
        if (arg == "-g" || arg == "--generate") {
            generateMaze();
        } else if (arg == "-r" || arg == "--read") {
            if (argv[2]) {
                readMaze();
            } else {
                throw invalid_argument("Имя файла не указано.");
            }
        } else if (arg == "-h" || arg == "--help") {
            printHelp("Для запуска выполните:");
        } else {
            char msg[128];
            snprintf(msg, 128, "Недопустимый аргумент %s", argv[1]);
            throw invalid_argument(msg);
        }
    } else {
        throw invalid_argument("Недопустимое количество аргументов.");
    }
}

/************************************************************************************/
/* Метод: void Application::printHelp(const char *msg)                              */
/* Цель: Вывод справки по запуску приложения                                        */
/* Исходные данные: msg - сообщение, выводимое перед текстом справки                */
/* Возвращаемое значение: нет                                                       */
/* Вызываемые модули: нет                                                           */
/* Дата: 2025 / 04 / 26 Версия 1.01                                                 */
/* Автор: Гущина М.О.                                                               */
/************************************************************************************/
void Application::printHelp(const char *msg)
{
    cout << msg << endl;
    cout << argv[0] << " [параметр запуска]\n Параметры запуска: " << endl;
    cout << "-g <имя_файла> - Сгенерировать лабиринт. Если указано <имя_файла>, то сохранить лабиринт в файл." << endl;
    cout << "-r [имя_файла] - Прочитать лабиринт из файла с именем [имя_файла]" << endl;
}
